       IDENTIFICATION DIVISION.
       PROGRAM-ID COBOL011.
      ******************************************************************
      * READ EMPLOYEE FILE AND WRITE INTO ANOTHER FILE               ***
      ******************************************************************
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EMPL-FILE-INPUT ASSIGN TO EMPLI
           FILE STATUS IS WS-EMP-STATUSI.

           SELECT EMPL-FILE-OUTPUT ASSIGN TO EMPLO
           FILE STATUS IS WS-EMP-STATUSO.

           SELECT EMPL-FILE-OUTPUTR ASSIGN TO EMPLR
           FILE STATUS IS WS-EMP-STATUSR.

       DATA DIVISION.
       FILE SECTION.
       FD EMPL-FILE-INPUT.
       01 EMPL-INPUT-RECORD PIC X(80).

       FD EMPL-FILE-OUTPUT.
       01 EMPL-OUTPUT-RECORD PIC X(80).
       FD EMPL-FILE-OUTPUTR.
       01 EMPL-OUTPUT-RECORDR PIC X(100).

       WORKING-STORAGE SECTION.
       01 WS-EMPL-INPUT-RECORD.
          05 WS-EMP-ID          PIC 9(08).
          05 WS-EMP-NAME        PIC X(10).
          05 WS-EMP-PROJ        PIC X(10).
          05 WS-EMP-GENDER      PIC X(01).
          05 WS-EMP-LOC         PIC X(03).
          05 WS-EMP-DESG        PIC X(15).
          05 WS-EMP-SALARY      PIC X(15).
          05 WS-ADM-DEP         PIC X(04).
          05 FILLER             PIC X(24).

       01 WS-EMP-STATUSI  PIC 9(2).
       01 WS-EMP-STATUSO  PIC 9(2).
       01 WS-EMP-STATUSR  PIC 9(2).
       01 WS-EMP-STATLOC  PIC 9(2).
       01 WS-EMP-STATDEP  PIC 9(2).
       PROCEDURE DIVISION.
           OPEN INPUT  EMPL-FILE-INPUT OUTPUT EMPL-FILE-OUTPUT
           EMPL-FILE-OUTPUTR.
      *     READ EMPL-FILE-INPUT INTO WS-EMPL-INPUT-RECORD
           PERFORM UNTIL  WS-EMP-STATUSI = 10
            INITIALIZE  WS-EMPL-INPUT-RECORD
            READ EMPL-FILE-INPUT INTO WS-EMPL-INPUT-RECORD
            DISPLAY WS-EMP-GENDER
            IF WS-EMP-GENDER = ' '
               DISPLAY 'I AM IN SPACE'
               CONTINUE
            ELSE
                IF WS-EMP-GENDER = 'M'
                    DISPLAY 'I AM IN M'
                    WRITE EMPL-OUTPUT-RECORDR FROM WS-EMPL-INPUT-RECORD
                ELSE
                    DISPLAY 'I AM IN F'
                    WRITE EMPL-OUTPUT-RECORD FROM WS-EMPL-INPUT-RECORD
                END-IF
            END-IF
            DISPLAY 'EMPL RECORD IS ' WS-EMPL-INPUT-RECORD
            MOVE 'ADMN'     TO WS-ADM-DEP
           END-PERFORM.

           CLOSE EMPL-FILE-INPUT EMPL-FILE-OUTPUT
           EMPL-FILE-OUTPUTR.
           STOP RUN.
